In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pylab as plt
import seaborn as sns

In [2]:
df = pd.read_csv("../assets/bank-full.csv", delimiter=";")
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [3]:
df.replace("unknown", np.nan, inplace = True)
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,NaN,5,may,261,1,-1,0,NaN,no
1,44,technician,single,secondary,no,29,yes,no,NaN,5,may,151,1,-1,0,NaN,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,NaN,5,may,76,1,-1,0,NaN,no
3,47,blue-collar,married,NaN,no,1506,yes,no,NaN,5,may,92,1,-1,0,NaN,no
4,33,NaN,single,NaN,no,1,no,no,NaN,5,may,198,1,-1,0,NaN,no

In [4]:
df.describe(include='all')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
count,45211.000000,44923,45211,43354,45211,45211.000000,45211,45211,32191,45211.000000,45211,45211.000000,45211.000000,45211.000000,45211.000000,8252,45211
unique,NaN,11,3,3,2,NaN,2,2,2,NaN,12,NaN,NaN,NaN,NaN,3,2
top,NaN,blue-collar,married,secondary,no,NaN,yes,no,cellular,NaN,may,NaN,NaN,NaN,NaN,failure,no
freq,NaN,9732,27214,23202,44396,NaN,25130,37967,29285,NaN,13766,NaN,NaN,NaN,NaN,4901,39922
mean,40.936210,NaN,NaN,NaN,NaN,1362.272058,NaN,NaN,NaN,15.806419,NaN,258.163080,2.763841,40.197828,0.580323,NaN,NaN
std,10.618762,NaN,NaN,NaN,NaN,3044.765829,NaN,NaN,NaN,8.322476,NaN,257.527812,3.098021,100.128746,2.303441,NaN,NaN
min,18.000000,NaN,NaN,NaN,NaN,-8019.000000,NaN,NaN,NaN,1.000000,NaN,0.000000,1.000000,-1.000000,0.000000,NaN,NaN
25%,33.000000,NaN,NaN,NaN,NaN,72.000000,NaN,NaN,NaN,8.000000,NaN,103.000000,1.000000,-1.000000,0.000000,NaN,NaN
50%,39.000000,NaN,NaN,NaN,NaN,448.000000,NaN,NaN,NaN,16.000000,NaN,180.000000,2.000000,-1.000000,0.000000,NaN,NaN
75%,48.000000,NaN,NaN,NaN,NaN,1428.000000,NaN,NaN,NaN,21.000000,NaN,319.000000,3.000000,-1.000000,0.000000,NaN,NaN
max,95.000000,NaN,NaN,NaN,NaN,102127.000000,NaN,NaN,NaN,31.000000,NaN,4918.000000,63.000000,871.000000,275.000000,NaN,NaN

In [39]:
missing_data = df.isnull()
infos = []
for column in missing_data.columns.values.tolist():
    print(column)
    infos.append(missing_data[column].value_counts(True))
    print(infos[-1])
    print("")

age
False    1.0
Name: age, dtype: float64

job
False    0.99363
True     0.00637
Name: job, dtype: float64

marital
False    1.0
Name: marital, dtype: float64

education
False    0.958926
True     0.041074
Name: education, dtype: float64

default
False    1.0
Name: default, dtype: float64

balance
False    1.0
Name: balance, dtype: float64

housing
False    1.0
Name: housing, dtype: float64

loan
False    1.0
Name: loan, dtype: float64

day
False    1.0
Name: day, dtype: float64

month
False    1.0
Name: month, dtype: float64

duration
False    1.0
Name: duration, dtype: float64

campaign
False    1.0
Name: campaign, dtype: float64

pdays
False    1.0
Name: pdays, dtype: float64

previous
False    1.0
Name: previous, dtype: float64

y
False    1.0
Name: y, dtype: float64

## Delete features with less than 85% values not NaN

In [40]:
for info_column in infos:
    if info_column.values[0] < .85:
        print(info_column.values[0])
        print(info_column.name)
        df.drop([info_column.name], axis=1, inplace=True )

## Replace NaN rows with most used values

In [49]:
for info_column in infos:
    if info_column.values[0] < 1:
        print(df[info_column.name].value_counts().idxmax())

blue-collar
secondary

In [48]:
for info_column in infos:
    if info_column.values[0] < 1:
        df[info_column.name].replace(np.nan, df[info_column.name].value_counts().idxmax(), inplace=True)

In [51]:
missing_data = df.isnull()
infos = []
for column in missing_data.columns.values.tolist():
    print(column)
    infos.append(missing_data[column].value_counts(True))
    print(infos[-1])
    print("")

age
False    1.0
Name: age, dtype: float64

job
False    1.0
Name: job, dtype: float64

marital
False    1.0
Name: marital, dtype: float64

education
False    1.0
Name: education, dtype: float64

default
False    1.0
Name: default, dtype: float64

balance
False    1.0
Name: balance, dtype: float64

housing
False    1.0
Name: housing, dtype: float64

loan
False    1.0
Name: loan, dtype: float64

day
False    1.0
Name: day, dtype: float64

month
False    1.0
Name: month, dtype: float64

duration
False    1.0
Name: duration, dtype: float64

campaign
False    1.0
Name: campaign, dtype: float64

pdays
False    1.0
Name: pdays, dtype: float64

previous
False    1.0
Name: previous, dtype: float64

y
False    1.0
Name: y, dtype: float64